nc: 20  # Pascal VOC Class အရေအတွက်
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  
  - [-1, 1, Conv, [128, 3, 2]] 
  - [-1, 1, PatchedC3k2, [128, False, 0.5]] 
  - [-1, 1, Conv, [256, 3, 2]] 
  - [-1, 1, PatchedC3k2, [256, False, 0.5]] 
  - [-1, 1, Conv, [512, 3, 2]] 
  - [-1, 1, PatchedC3k2, [512, False, 0.5]] 
  - [-1, 1, Conv, [512, 3, 2]] 
  - [-1, 1, PatchedC3k2, [512, True, 0.5]]  
  - [-1, 1, SPPF, [512, 5]]    
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  
  - [-1, 1, C3k2, [512, False, 0.5]] 
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  
  - [-1, 1, C3k2, [256, False, 0.5]] 
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] 
  - [-1, 1, C3k2, [512, False, 0.5]] 
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  
  - [-1, 1, C3k2, [512, True, 0.5]]  
  - [[15, 18, 21], 1, Detect, [nc]]